In [ ]:
import cx_Oracle
import pandas as pd
import numpy as np

In [ ]:
conn = cx_Oracle.connect('PYTHON/PYTHON@localhost')

In [ ]:
sql_query = ''

In [ ]:
def check_SQL_result(query = sql_query,conn=conn):
    result_df = pd.read_sql(query, con=conn)
    print(result_df)

In [ ]:
def load_data_frame (table_name , conn = conn):
    query = 'SELECT * FROM '+table_name
    df_ora = pd.read_sql(query, con=conn)
    return df_ora

### E1_Big Countries

In [ ]:
"""/* 
There is a table World
+-----------------+------------+------------+--------------+---------------+
| name            | continent  | area       | population   | gdp           |
+-----------------+------------+------------+--------------+---------------+
| Afghanistan     | Asia       | 652230     | 25500100     | 20343000      |
| Albania         | Europe     | 28748      | 2831741      | 12960000      |
| Algeria         | Africa     | 2381741    | 37100000     | 188681000     |
| Andorra         | Europe     | 468        | 78115        | 3712000       |
| Angola          | Africa     | 1246700    | 20609294     | 100990000     |
+-----------------+------------+------------+--------------+---------------+
A country is big if it has an area of bigger than 3 million square km or a population of more than 25 million.

Write a SQL solution to output big countries' name, population and area.
*/

CREATE TABLE WORLD (NAME VARCHAR(255), CONTINENT VARCHAR(255), AREA INT, POPULATION INT, GDP INT);

TRUNCATE TABLE WORLD;
INSERT ALL 
INTO WORLD (NAME, CONTINENT, AREA, POPULATION, GDP) VALUES ('AFGHANISTAN', 'ASIA', '652230', '25500100', '20343000000')
INTO WORLD (NAME, CONTINENT, AREA, POPULATION, GDP) VALUES ('ALBANIA', 'EUROPE', '28748', '2831741', '12960000000')
INTO WORLD (NAME, CONTINENT, AREA, POPULATION, GDP) VALUES ('ALGERIA', 'AFRICA', '2381741', '37100000', '188681000000')
INTO WORLD (NAME, CONTINENT, AREA, POPULATION, GDP) VALUES ('ANDORRA', 'EUROPE', '468', '78115', '3712000000')
INTO WORLD (NAME, CONTINENT, AREA, POPULATION, GDP) VALUES ('ANGOLA', 'AFRICA', '1246700', '20609294', '100990000000')
SELECT * FROM DUAL;

SELECT * FROM WORLD;
"""
print()

SQL Query 

SELECT NAME, 
POPULATION, 
AREA
FROM WORLD
WHERE AREA > 3000000 OR POPULATION > 25000000;

In [ ]:
df_ora = load_data_frame('WORLD')

In [ ]:
df_ora[(df_ora['AREA'] > 3000000) | (df_ora['POPULATION'] > 25000000 )][['NAME','POPULATION','AREA']]

In [ ]:
result_query = "SELECT NAME, POPULATION, AREA FROM WORLD WHERE AREA > 3000000 OR POPULATION > 25000000"

In [ ]:
check_SQL_result(result_query)

### E2_Swap Salary

In [ ]:
"""/*
Given a table salary, such as the one below, that has m=male and f=female values. 
Swap all f and m values (i.e., change all f values to m and vice versa) with a single update statement and no intermediate temp table.

Note that you must write a single update statement, DO NOT write any select statement for this problem.
Example:

| id | name | sex | salary |
|----|------|-----|--------|
| 1  | A    | m   | 2500   |
| 2  | B    | f   | 1500   |
| 3  | C    | m   | 5500   |
| 4  | D    | f   | 500    |
After running your update statement, the above salary table should have the following rows:
| id | name | sex | salary |
|----|------|-----|--------|
| 1  | A    | f   | 2500   |
| 2  | B    | m   | 1500   |
| 3  | C    | f   | 5500   |
| 4  | D    | m   | 500    |
*/

CREATE TABLE SALARY(ID INT, NAME VARCHAR(100), SEX CHAR(1), SALARY INT);
TRUNCATE TABLE SALARY;
INSERT ALL 
INTO SALARY (ID, NAME, SEX, SALARY) VALUES ('1', 'A', 'M', '2500')
INTO SALARY (ID, NAME, SEX, SALARY) VALUES ('2', 'B', 'F', '1500')
INTO SALARY (ID, NAME, SEX, SALARY) VALUES ('3', 'C', 'M', '5500')
INTO SALARY (ID, NAME, SEX, SALARY) VALUES ('4', 'D', 'F', '500')
SELECT * FROM DUAL;

SELECT * FROM SALARY;
COMMIT;
"""
print()

SQL Query 
Method 1. update salary  set sex = decode(sex,'M','F','M');

Method 2. update salary set sex = case
                        when sex = 'F' then 'M'
                        else 'F'
                    end

In [ ]:
df_ora = load_data_frame('SALARY')

In [ ]:
df_ora

In [ ]:
#Method 1
df_ora['SEX'] = np.where(df_ora['SEX']=='M', 'F', 'M')

In [ ]:
df_ora

In [ ]:
#Method 2
df_ora['SEX'] = df_ora['SEX'].apply({'F':'M', 'M':'F'}.get)

In [ ]:
df_ora

In [ ]:
"""
/*
X city opened a new cinema, many people would like to go to this cinema. The cinema also gives out a poster indicating the movies ratings and descriptions.

Please write a SQL query to output movies with an odd numbered ID and a description that is not 'boring'. 
Order the result by rating.


For example, table cinema:\
+---------+-----------+--------------+-----------+
|   id    | movie     |  description |  rating   |
+---------+-----------+--------------+-----------+
|   1     | War       |   great 3D   |   8.9     |
|   2     | Science   |   fiction    |   8.5     |
|   3     | irish     |   boring     |   6.2     |
|   4     | Ice song  |   Fantacy    |   8.6     |
|   5     | House card|   Interesting|   9.1     |
+---------+-----------+--------------+-----------+

For the example above, the output should be:
+---------+-----------+--------------+-----------+
|   id    | movie     |  description |  rating   |
+---------+-----------+--------------+-----------+
|   5     | House card|   Interesting|   9.1     |
|   1     | War       |   great 3D   |   8.9     |
+---------+-----------+--------------+-----------+
*/

CREATE TABLE CINEMA (ID INT, MOVIE VARCHAR(255), DESCRIPTION VARCHAR(255), RATING FLOAT);
TRUNCATE TABLE CINEMA;
INSERT ALL 
INTO CINEMA (ID, MOVIE, DESCRIPTION, RATING) VALUES ('1', 'WAR', 'GREAT 3D', '8.9')
INTO CINEMA (ID, MOVIE, DESCRIPTION, RATING) VALUES ('2', 'SCIENCE', 'FICTION', '8.5')
INTO CINEMA (ID, MOVIE, DESCRIPTION, RATING) VALUES ('3', 'IRISH', 'BORING', '6.2')
INTO CINEMA (ID, MOVIE, DESCRIPTION, RATING) VALUES ('4', 'ICE SONG', 'FANTACY', '8.6')
INTO CINEMA (ID, MOVIE, DESCRIPTION, RATING) VALUES ('5', 'HOUSE CARD', 'INTERESTING', '9.1')
SELECT * FROM DUAL;
SELECT * FROM CINEMA;
COMMIT;


SELECT *
FROM CINEMA
WHERE MOD(ID,2) = 1 --%2, 
AND DESCRIPTION != 'BORING'
ORDER BY RATING DESC;
"""
print()

In [ ]:
df = load_data_frame('CINEMA')

In [ ]:
df

In [ ]:
df[(df['ID']%2 != 0) & (df['DESCRIPTION'] != 'BORING') ].sort_values(['ID'],ascending = False)

In [ ]:
sql_query = "SELECT * FROM CINEMA WHERE MOD(ID,2) = 1 AND DESCRIPTION != 'BORING' ORDER BY RATING DESC"

In [ ]:
check_SQL_result(sql_query)

### Duplicate Email

In [ ]:
"""
/*
Write a SQL query to find all duplicate emails in a table named Person.
+----+---------+
| Id | Email   |
+----+---------+
| 1  | a@b.com |
| 2  | c@d.com |
| 3  | a@b.com |
+----+---------+

For example, your query should return the following for the above table:

+---------+
| Email   |
+---------+
| a@b.com |
+---------+
Note: All emails are in lowercase.
*/

CREATE TABLE PERSON (ID INT, EMAIL VARCHAR(255));
TRUNCATE TABLE PERSON;
INSERT ALL 
INTO PERSON (ID, EMAIL) VALUES ('1', 'A@B.COM')
INTO PERSON (ID, EMAIL) VALUES ('2', 'C@D.COM')
INTO PERSON (ID, EMAIL) VALUES ('3', 'A@B.COM')
SELECT * FROM DUAL;
SELECT * FROM PERSON;
COMMIT;

SELECT EMAIL
FROM PERSON
GROUP BY EMAIL
HAVING COUNT(EMAIL) > 1; --GROUP BY SHOULD BE USED WITH "HAVING"

"""
print()

In [ ]:
df = load_data_frame('PERSON')

In [ ]:
df.groupby('EMAIL').filter(lambda group : len(group)>1).groupby('EMAIL').last().reset_index().EMAIL

In [ ]:
sql_query = "SELECT EMAIL FROM PERSON GROUP BY EMAIL HAVING COUNT(EMAIL) > 1"

In [ ]:
check_SQL_result()

### Analyse Sales Part 1

In [ ]:
"""
/*
 * Reports all product names of the products in the Sales table along with their selling year and price
 * 
Sales table:
+---------+------------+------+----------+-------+
| sale_id | product_id | year | quantity | price |
+---------+------------+------+----------+-------+ 
| 1       | 100        | 2008 | 10       | 5000  |
| 2       | 100        | 2009 | 12       | 5000  |
| 7       | 200        | 2011 | 15       | 9000  |
+---------+------------+------+----------+-------+

Product table:
+------------+--------------+
| product_id | product_name |
+------------+--------------+
| 100        | Nokia        |
| 200        | Apple        |
| 300        | Samsung      |
+------------+--------------+

Result table:
+--------------+-------+-------+
| product_name | year  | price |
+--------------+-------+-------+
| Nokia        | 2008  | 5000  |
| Nokia        | 2009  | 5000  |
| Apple        | 2011  | 9000  |
+--------------+-------+-------+*/

DROP TABLE SALES;
CREATE TABLE SALES (SALE_ID INT, PRODUCT_ID INT, YEAR INT, QUANTITY INT, PRICE INT);
TRUNCATE TABLE SALES;
INSERT ALL 
INTO SALES (SALE_ID, PRODUCT_ID, YEAR, QUANTITY, PRICE) VALUES ('1', '100', '2008', '10', '5000')
INTO SALES (SALE_ID, PRODUCT_ID, YEAR, QUANTITY, PRICE) VALUES ('2', '100', '2009', '12', '5000')
INTO SALES (SALE_ID, PRODUCT_ID, YEAR, QUANTITY, PRICE) VALUES ('7', '200', '2011', '15', '9000')
SELECT * FROM DUAL;
SELECT * FROM SALES;

DROP TABLE PRODUCT;
CREATE TABLE PRODUCT (PRODUCT_ID INT, PRODUCT_NAME VARCHAR(255));
TRUNCATE TABLE PRODUCT;
INSERT ALL 
INTO PRODUCT (PRODUCT_ID, PRODUCT_NAME) VALUES ('100', 'NOKIA')
INTO PRODUCT (PRODUCT_ID, PRODUCT_NAME) VALUES ('200', 'APPLE')
INTO PRODUCT (PRODUCT_ID, PRODUCT_NAME) VALUES ('300', 'SAMSUNG')
SELECT * FROM DUAL;
SELECT * FROM PRODUCT;
COMMIT;

Result : 

select a.product_name,b.year,b.price from product a 
join sales b on a.product_id = b.product_id;
"""

print()

In [ ]:
df_product = load_data_frame('PRODUCT')
df_sales = load_data_frame('SALES')

In [ ]:
#pd.merge(df1, indexed_df2, left_on='key', right_index=True)
pd.merge(df_product,df_sales,on = 'PRODUCT_ID' )[['PRODUCT_NAME','YEAR','PRICE']]

In [ ]:
sql_query = 'select a.product_name,b.year,b.price from product a join sales b on a.product_id = b.product_id'

In [ ]:
check_SQL_result(sql_query)

### Analyse Sales Part 2

In [ ]:
"""
Write an SQL query that reports the total quantity sold for every product id.

The query result format is in the following example:

Result table:
+--------------+----------------+
| product_id   | total_quantity |
+--------------+----------------+
| 100          | 22             |
| 200          | 15             |
+--------------+----------------+

"""
print()

In [ ]:
df_sales.groupby('PRODUCT_ID').agg({'QUANTITY':np.sum})

In [ ]:
"""
/*Table: Activity
+--------------+---------+
| Column Name  | Type    |
+--------------+---------+
| player_id    | int     |
| device_id    | int     |
| event_date   | date    |
| games_played | int     |
+--------------+---------+
(player_id, event_date) is the primary key of this table.
This table shows the activity of players of some game.
Each row is a record of a player who logged in and played a number of games (possibly 0) before logging out on some day using some device.

Write an SQL query that reports the first login date for each player.

The query result format is in the following example:

Activity table:
+-----------+-----------+------------+--------------+
| player_id | device_id | event_date | games_played |
+-----------+-----------+------------+--------------+
| 1         | 2         | 2016-03-01 | 5            |
| 1         | 2         | 2016-05-02 | 6            |
| 2         | 3         | 2017-06-25 | 1            |
| 3         | 1         | 2016-03-02 | 0            |
| 3         | 4         | 2018-07-03 | 5            |
+-----------+-----------+------------+--------------+

Result table:
+-----------+-------------+
| player_id | first_login |
+-----------+-------------+
| 1         | 2016-03-01  |
| 2         | 2017-06-25  |
| 3         | 2016-03-02  |
+-----------+-------------+*/

DROP TABLE ACTIVITY;
CREATE TABLE ACTIVITY (PLAYER_ID INT, DEVICE_ID INT, EVENT_DATE DATE, GAMES_PLAYED INT);
TRUNCATE TABLE ACTIVITY;
INSERT ALL
INTO ACTIVITY (PLAYER_ID, DEVICE_ID, EVENT_DATE, GAMES_PLAYED) VALUES ('1', '2', TO_DATE('2016-03-01', 'YYYY-MM-DD'), '5')
INTO ACTIVITY (PLAYER_ID, DEVICE_ID, EVENT_DATE, GAMES_PLAYED) VALUES ('1', '2', TO_DATE('2016-05-02', 'YYYY-MM-DD'), '6')
INTO ACTIVITY (PLAYER_ID, DEVICE_ID, EVENT_DATE, GAMES_PLAYED) VALUES ('2', '3', TO_DATE('2017-06-25', 'YYYY-MM-DD'), '1')
INTO ACTIVITY (PLAYER_ID, DEVICE_ID, EVENT_DATE, GAMES_PLAYED) VALUES ('3', '1', TO_DATE('2016-03-02', 'YYYY-MM-DD'), '0')
INTO ACTIVITY (PLAYER_ID, DEVICE_ID, EVENT_DATE, GAMES_PLAYED) VALUES ('3', '4', TO_DATE('2018-07-03', 'YYYY-MM-DD'), '5')
SELECT * FROM DUAL;
SELECT * FROM ACTIVITY;

SELECT PLAYER_ID,
MIN(EVENT_DATE) FIRST_LOGIN
FROM ACTIVITY
GROUP BY PLAYER_ID;

"""

print()

In [ ]:
df  = load_data_frame('ACTIVITY')

In [ ]:
df.groupby('PLAYER_ID').agg({'EVENT_DATE':np.min}).sort_values('PLAYER_ID',ascending = True)

In [ ]:
sql_query = 'SELECT PLAYER_ID, MIN(EVENT_DATE) FIRST_LOGIN FROM ACTIVITY GROUP BY PLAYER_ID'

In [ ]:
check_SQL_result()

In [33]:
"""
/*
The Employee table holds all employees including their managers. Every employee has an Id, and there is also a column for the manager Id.

+----+-------+--------+-----------+
| Id | Name  | Salary | ManagerId |
+----+-------+--------+-----------+
| 1  | Joe   | 70000  | 3         |
| 2  | Henry | 80000  | 4         |
| 3  | Sam   | 60000  | NULL      |
| 4  | Max   | 90000  | NULL      |
+----+-------+--------+-----------+
Given the Employee table, write a SQL query that finds out employees who earn more than their managers. 
For the above table, Joe is the only employee who earns more than his manager.

+----------+
| Employee |
+----------+
| Joe      |
+----------+
*/

DROP TABLE EMPLOYEE;
CREATE TABLE EMPLOYEE (ID INT, NAME VARCHAR(255), SALARY INT, MANAGERID INT);
TRUNCATE TABLE EMPLOYEE;
INSERT ALL
INTO EMPLOYEE (ID, NAME, SALARY, MANAGERID) VALUES ('1', 'JOE', '70000', '3')
INTO EMPLOYEE (ID, NAME, SALARY, MANAGERID) VALUES ('2', 'HENRY', '80000', '4')
INTO EMPLOYEE (ID, NAME, SALARY) VALUES ('3', 'SAM', '60000')
INTO EMPLOYEE (ID, NAME, SALARY) VALUES ('4', 'MAX', '90000')
SELECT * FROM DUAL;
SELECT * FROM EMPLOYEE;
commit;


-- [METHOD 1]
SELECT E.NAME AS EMPLOYEE
FROM EMPLOYEE E, 
EMPLOYEE M
WHERE E.MANAGERID= M.ID --SELF JOIN
AND E.SALARY > M.SALARY


--[METHOD 2]
SELECT E.NAME AS EMPLOYEE
FROM EMPLOYEE E
WHERE EXISTS (
               SELECT 1
                 FROM EMPLOYEE M
                WHERE E.MANAGERID = M.ID
                  AND E.SALARY > M.SALARY
              );
--[METHOD 3]            
select e1.name from employee e1 where e1.salary > (select e2.salary from employee e2 where e1.managerid = e2.id);
--[METHOD 4]
select e1.name from employee e1, employee e2 where e1.managerid = e2.id and e1.salary > e2.salary;


"""
print()

In [38]:
df = load_data_frame('EMPLOYEE')